#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag                   = "57e7df2d7008c3c7b65eb26cdda799c5" -> "603845855702197a506bf4e6cea37f4d"
        id                     = "lambdas/demo/add_investment_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag                   = "3788f3ca9847cb837dbd887e44d7aab9" -> "4d20ca5e6c298bb7d4a17b33307d363c"
        id                     = "lambdas/demo/add_scenario_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag                   = "50cfe056180b1f3ced2c0fb951fb6c3d" -> "dff7360998aa07c4d843d91923280f3e"
        id                     = "lambdas/demo/add_tag_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag                   = "3338b0ae0fabef57b7178c9412547a20" -> "43dc0175502ea727fccce376ddd973d6"
        id                     = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag                   = "4128595fb4896322d51a0f88da9865a2" -> "1bf5a5a186382d6ecfb95687b717dd91"
        id                     = "lambdas/demo/assign_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag                   = "4d5a2ed77bc7429d702c26f61da5cbf4" -> "4fe80aa72c787d0f2911b79f60cb4f31"
        id                     = "lambdas/demo/authorize_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag                   = "4cad8c9e52c160d034dee79d9aeb4e19" -> "00421477255d9cb97a53f4ee36501e45"
        id                     = "lambdas/demo/change_company_publicly_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag                   = "81b6db2cec02158a020b21f57782af4e" -> "14298b59fe40f0d4bac8ab7bc3f00b8d"
        id                     = "lambdas/demo/change_user_role_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag                   = "82b1947b91029fb01001a5f73695b2a4" -> "2977629cfa24b686ac2c4cdde520f786"
        id                     = "lambdas/demo/connect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag                   = "b92ffb7d131303149f999989018ac2d0" -> "806c6af617e2c9f81a205a1187a4f8d8"
        id                     = "lambdas/demo/delete_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag                   = "30efeda4f726b03946fc99aba22dacb2" -> "2ecafab2477dc64bfd8b57ab5a067664"
        id                     = "lambdas/demo/delete_scenarios_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag                   = "0094a083cc567a2205f013ad94864190" -> "d89cc9471c1c440f279d28855ebdba05"
        id                     = "lambdas/demo/delete_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag                   = "b6054a6d436b75f795c5f95343aee14e" -> "238c60431931bd1c9d406489b259fe5f"
        id                     = "lambdas/demo/disconnect.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag                   = "b18d05f276b6a4cb86ba1e43e9082b20" -> "0eaef90caf0b8060cc3798219baec9da"
        id                     = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag                   = "c43d1e3824da4a3b97af210ea673eb0e" -> "80699c982e001fb582e11e7e229951ae"
        id                     = "lambdas/demo/edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag                   = "73a3525e82c21ca7deb6837e6cf33b6e" -> "b8551cb2f0024eb137d9100e5eb98bd2"
        id                     = "lambdas/demo/get_all_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag                   = "17a6ba5c446649365c7596118d0160d3" -> "16a71e8b05bd754e9c411f3955488500"
        id                     = "lambdas/demo/get_all_public_companies_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag                   = "c9c8aafa641cc76599683a4eb6c0c1a1" -> "b30cfbf090091c85fd577fce057aae30"
        id                     = "lambdas/demo/get_all_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag                   = "bff862d2d38f219185c99699dfa1032c" -> "3c7924b9e9a8a135fe8aa491812b989a"
        id                     = "lambdas/demo/get_all_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag                   = "4847992625bfadd227ff0bd118552f64" -> "894339d6a30ecdef9af98075754a1488"
        id                     = "lambdas/demo/get_by_metric_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag                   = "843f85011caed13e338e200803aa1b21" -> "445012ff431fa976ce1e51ffcdecf366"
        id                     = "lambdas/demo/get_company_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag                   = "329024f0a63139263902c9e15e0cee2c" -> "f5159430b20e1298003fef6eb291e559"
        id                     = "lambdas/demo/get_company_investments_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag                   = "729dfcb9ef73047e0fb962337a133876" -> "83e7dfe1d381fe7d77388fef5d2dd275"
        id                     = "lambdas/demo/get_company_permissions_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag                   = "7feffae0a98bbadffeec6a058b6f1005" -> "545c624992ecfd194c3f1e58040886bd"
        id                     = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag                   = "faa82e5a9ae8b0ddd4db9bc742214b84" -> "2cf48c2740e469be22310d06ccd5ffc9"
        id                     = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag                   = "73ae59aa85ace038963371d0e2fa8da1" -> "dd75d5ba51ed814c3ecc569874ba937c"
        id                     = "lambdas/demo/get_dynamic_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag                   = "4e65a87c18a074fcdbc7901add4798fe" -> "15b66bb76601d06d6ea930414c4e9564"
        id                     = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag                   = "6ba2428a7658baca45fb9bc9b395c630" -> "4fcc3506fb2c76103997050d18953190"
        id                     = "lambdas/demo/get_full_year_total_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag                   = "ceaf4e0abf3fbe0e6084d53e18d4e887" -> "26866c7ddf1a8e8d662c19d96d8b946f"
        id                     = "lambdas/demo/get_investment_date_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag                   = "d61b469d306a7979ef5b8cf766e37f2d" -> "be91a6e23c03b5a5a8b3caee5641a9a3"
        id                     = "lambdas/demo/get_metric_types_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_quarters_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_quarters_report_function_object" {
      ~ etag                   = "e5a81844d54291b93e7f5be1aaf55e2c" -> "3f5af9714d38c1236d5fedeb6bff5e01"
        id                     = "lambdas/demo/get_quarters_report_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag                   = "93ef87cfd24f93ebfc7475296a4b212b" -> "eafa50e0ca46abc263688b6640c6e96b"
        id                     = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag                   = "d389acca54530a36b5461c3b72f7ddaf" -> "240c669cce81fb37fe60dc3d158220c2"
        id                     = "lambdas/demo/get_roles_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag                   = "59b202daae3eb987a792b3235ba33a9f" -> "e594ee38e8791b7194d32caf3adf2676"
        id                     = "lambdas/demo/get_tags_by_company_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag                   = "7ffa0824538bb8aaa7c1e01e758bce4a" -> "11d43ec8e7ac6c0a1c6f907e58c905ab"
        id                     = "lambdas/demo/get_universe_overview_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag                   = "410744dd310b75ddd72c69d9c692a0c9" -> "c7f779422ff3a08805f964c9ac11a5e1"
        id                     = "lambdas/demo/get_user_details_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag                   = "65b7280c8faa0d2a3d1054f667b8fea0" -> "5b83d861b31e879806084ccf04d53be0"
        id                     = "lambdas/demo/get_users_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag                   = "b25a9d77a1b23a599e80d1a43d6077a7" -> "9c9ab81e51ae77df2a29af62b0a391bb"
        id                     = "lambdas/demo/glue_trigger_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag                   = "45b55f3b8cd5f52c117f04c3a028e2e8" -> "9d50d584f52125b9bb4ad85b89a4d774"
        id                     = "layer/demo/layer_libraries.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag                   = "8e99825a2b9d9bbd16fb92d155271739" -> "edd5d70ae13afe79ca6be8f474d1be80"
        id                     = "lambdas/demo/message.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag                   = "0c4d1a4b9125b515e0c8ec194bce82ac" -> "9567bf14dd4a90d1def6b262a12f3be1"
        id                     = "lambdas/demo/modify_ranges_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag                   = "a82aa38a051f8139e9ac98a867339815" -> "6a132ae9b47fed0ad542aceef05eb80c"
        id                     = "lambdas/demo/register.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag                   = "d19aaae81f73f1a9ffd0e1ccc0473c21" -> "59409ea1bbafc3506d1d44817d012ad3"
        id                     = "lambdas/demo/update_data.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag                   = "c9202f098bd7304518dd5e09b9ad78ee" -> "c20a0807d8c11cfc0a41a53e5cd26091"
        id                     = "lambdas/demo/update_tags_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag                   = "571f0a65a82dd60396a6ca7290ef34d1" -> "6ed15f0740736c652cbdcb6ed6164b7a"
        id                     = "lambdas/demo/upload_file_s3_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag                   = "406f4a95ec5b6dfc867ccfb975280aaa" -> "23a9314450196bb7cfba00bca24f0e0d"
        id                     = "lambdas/demo/validate_data_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag                   = "bcdf3a62cb64a2e81e65c6902814564c" -> "df115da9689d03fbb3237ec2731ddbff"
        id                     = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "xwm+aoys4laM3glwLemKzM31dQ0S0TfzM8OakW2iMdU=" -> "0/0e/2QACK3lU3HadJj/Xpe5mY0RztIIx2Xo/nesqhM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:56.000+0000" -> (known after apply)
      ~ source_code_hash               = "m99kbbBh/8Q7UC1QfN2CVFAcRsqXVwQIbm/tvu263D4=" -> "yReYA9GqoAo5bk1oUrA4vgyVEjtxE//CMAEgUyqm4MA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "TiBSblOERlt/sHuMucn8SpfVwQJnf1QVqgxSQtDv4Ks=" -> "8ouCjj+boHNyqM1VPElVfx76yqh2+zY3WEB0h6w4DMU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "lKJ4ChD3apQMyojKFi1pRATz7B7ueuKVyxNYhixuDGg=" -> "93dGQggRHZ7wmXOCc0PtoEnmMGYbhQL7GeJ2x21oOIw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "zHFS1w/N4akZ+41NlR/AF21rCMZyuNSwO1xjwcCPMoM=" -> "lEhtUsY5XxV/mIOl1S/G72z88GzcuRqMEkhcsSCID+I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:45.000+0000" -> (known after apply)
      ~ source_code_hash               = "+oga4d977S0jr5/DOZ1veVxyJZhk3NXZNK4nYJC9tFw=" -> "LInxGkrhpTe2O7hyfusbdxVOXcejBRTLrKfB+WP2ku4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "1h9QqJPG4IQpGmZ0i6f6yuQdbz/8dPGuwl0oobhCCLY=" -> "KRRDsjL1gKglmQhP8jUuMUrlpDclyad/scEoahexH9k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "dy0wEB93P2GPMkNkfihQqZwUzPkSHGyez2jaoaMWVKE=" -> "UzIO9bWjqup1NQbbmDHnXx7b8q1ScZWHXfFQG14pr88="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "mNftg8hYhgqvf7yDw8/NuyDB8idr1TMwcrZEclNwoeQ=" -> "9AZ66l4nMOynn8z2m25KPeAyqK6Z7QvY+o85cF8MOvk="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "I3IpC2DozXpvIbxZme9P0SSO0e1dzGJgjAo3FG9n/SY=" -> "86JSgKOmIH/+vkLJnXwLk2BYj1Nl2+DZfQyJ6H7KJ9c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "Bapcxv+aAgBT+OaCYQnOLleDT29WTZl9FmiNGovy2cM=" -> "aFGvLqg6ww6f5EqPTlPGtvJGsPgrz03oUJpMEeHFar8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:55.000+0000" -> (known after apply)
      ~ source_code_hash               = "YklKY07FPBupAVSJ/tNsTlvmB4Cx5TwC6nX/9YzsNGU=" -> "MRIM5jZHQ/Wq/+zO7uQAa57YY36tdmabVCMwIo08T78="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "4EYGTiheQ5QO5OquoKW08kPFo5Atk5DE+/Ho6U5R/Og=" -> "Sy+7+C8rYHaDC0snkLK5t5M/s3z4j9FqQ2C8fvDsAlU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "VQ49ajF8i8BCcwWYMbTry8CIajm/WN9JyfpBaEZ7lDI=" -> "zItiD1sB/omY5HXivHqCKDQNyLEWW+0M40crJ+kqL6c="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "9BYQf1zMDeQ7VxmEz6/3VDab8Do7P2ddG9Nbd9UM/ME=" -> "PhRvtjY5IEdEjocuhbJon8oMjiPUSfWTyTProdMux3o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "qiHWduLehLrYvBy0ALSwz3thl5SVJybBvJXZo22aLeA=" -> "UiRDYbEsls953d5y7IB0GYXuRD97QslFXkD8opbHzyc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "bQQUrDU0T+ow8iA0ugTAElOcSXXL46NgKiTLqf5w40k=" -> "7cZk6A8HaM+Rf9xEeOMobavVYITtyMx/KopAcNlRjlI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "Hm8Fq6ensImSqGEBzASJQemVpaQhcB26utSQWNm+69g=" -> "+2nQpmalrSF9KqA9jNe38cG/+tBQCqMTVV9X5r3qImI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "D7vxwMI0VC+WgmYBrV+PsyMwxBx1RQyFqE5IcEqwGm8=" -> "RdhsjcYD0MWGg6Zxv1/r23i07DEbTHTgVQGU3edGfuY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "gWqGCw6XrIyE0u/IUJSE0A6JJu8Z25yiU6Ga+2Kk2rA=" -> "F/5G6WiNWRTZM3P+WPZ5iLgnlM7GLX461JeqWcvjcYs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "cD9WEkBlxLYRxNUPk5cNRukH+lGUBTQKxKvPn9Ho5Oc=" -> "ChgXhj/EuUsyS8WNbsI+wTpmMfVa7ETuWGikietZ3kY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "rJqfftO8Se8mWFrdtNiTao2JTpL3+aY4TZ3MnSxGWUw=" -> "2fPYwKrAZpDuzWFtcc+S9cOgJgqwqC5P3INO+Cg8sXM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "krIkaCfsFGAVlqmICq2WWHv8IFTXudxy3FJV6YbHuBg=" -> "FY6wmQDGnQvA/u1TKE4UXHH78KyTwHhHYJQO+O7a15I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "n8iWEQ25RGECFbHbOxuzv3ZB2qEHc/l/7cBAjWl9cMY=" -> "TzYXxnGQrD9ItOv20v9ZboJpibVn7/+FJMCZgaHnSRE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "TBjkuWbuyOKg9OWX6gY0Su80gQD99nJ3Z1VaAqrZ6dM=" -> "pESYz4KQIVkYPNWqKFv710hocwvTVD+8UYH3Jh4DgLc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "beXM3QnGZjyKdxt+5bqtjwHcyGgPA4w/pNbLcUelmk4=" -> "tT+1Ynhbhc/yxGZD4FD4ZKc9Xtqv0n1sDB8VKRqzz+A="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "8B//IRMBXi6bNtohBuIRcGlVyyIAKz86Eyx2XZudSSQ=" -> "NY97MHq6JAKDBiQU/wxaUO4jN26bMq2ZBTnxxzZjOPE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "lC1FmgkT5ZQbpXXEOMskDJpQjlzBPiklYBCd53IGo6s=" -> "ZFB775IkFd1vd3oxSoAs9/UkNvlj2QceL92NgQZ0J88="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "zcQ5pjPZwrGTqp/C89uj9jV3lUiiSUflCSvhmbJk1Z4=" -> "GNtQ3/f/7Ex3MKV88IkkzkEHt2Afhlw62EwG1Kk9XSM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "6hkOPDDfAMSHBjbFtp+H2Hvdb4sMibwVy+sxoOQ84KM=" -> "P8H3C6vcC8khnhVXqkeveK0csCe46tkMZKKkkirHudU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_quarters_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_quarters_report_lambda_function" {
        id                             = "demo_get_quarters_report_lambda_function"
      ~ last_modified                  = "2023-02-10T21:04:21.000+0000" -> (known after apply)
      ~ source_code_hash               = "dx81ziWWu7uB8T42bE5T3OOTfVjd2Pj8slt1f51uo2s=" -> "MsrUnZ0SGmV6x38Y1OSWaDUEqRHKepSVTkpZ8o4IxGs="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "aa+vWUHgeNxVQHVVD8Gj5VpG/hEkmwQANxCApQzAoLg=" -> "d8v1ljef1ke0HDafxaQSsUAx2MUKIbVVHsnICs+RnF4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "ObiT14FEby8/jmkhvjoeJtbBpOHtqaNdnu9rJ2OI/y0=" -> "g1BqwiPH2YuBssGYs1OnKaWA6xp0bbK9dcRRNSATOic="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:53.000+0000" -> (known after apply)
      ~ source_code_hash               = "ODBb4BnMAwn3pVIokHyP4gdxVjyDsNmP6WbyH1pESjc=" -> "hUqSaad5HQMUmbtOsfCZLqVbxhuGrqLzX4pD56T5AKc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "cZ0WGzTSTXuIC/sFj0YOBm8ztcGHIxJOqgvfBdmt+Sk=" -> "Arb04tFZSymxI0AguIAToZHAko974ow5W9xcGjGSGFQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:28.000+0000" -> (known after apply)
      ~ source_code_hash               = "0SCcUONwwVG00AeW3fUIqRxiNK51RvWR5RF3KnfkBWc=" -> "Q9cIzWGoOTsTEh3+QYgMzdjJ7say7bGV0uKNRd3D45k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "F5Bt66sSh13xbtA2O8peJFnWwpsofbM0/zOWM4TbMFw=" -> "Wc8YjDi190Ej+Ez2Vl4uY2Eyb5jMeR7Wlc8gKnOe9MY="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "pfiZ/qkphf9P0mQvpw1PmJXwf8hfw5Mjijam9PEsv/0=" -> "xdBC2gqinvfxPT+I1Mhbrzq2QzDrmocAW1xfsYJin14="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "C3IqP8JCpZctg8T0Y0Mjc8j4KKT+f0Ay5K8Jv84C0nA=" -> "2ZPuoDbIVJeJshLBbwh26gCwAY+gOvlN+yGyisdZLo8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "mvZzWvomp7sD//F/8bh/dCPwLg9OjaS/0PSYZzHz5F0=" -> "4QQi/sSrG/uVEpP1fIeW78rJ3GY8YyCPtTQqSE7urLU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "MmQCYcvj4YCYnCa8nPjCdA8lZNhk7MLJsvzdZF8e10M=" -> "IMez3gA6kbUGbnDOPYGMBaDJlSvcyfG2iJNqd1WcZV4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:10.000+0000" -> (known after apply)
      ~ source_code_hash               = "/aOdUCsru9JBvpom/W/5LPfl8eaOAaBfwo5eG+/rKEs=" -> "YDJY5X39WDQuQha+dr/P+rRS4w5lc+jCD0gG4nQYtAA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "Gqoo3Sb/iM7P25W3RFv6LRii8lUfhqXxPf+wF7YyJ2Y=" -> "wxjd/I6ZCqVeTpH1/jM2cv068FsdJLtlkhS6S4P/rjA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:54.000+0000" -> (known after apply)
      ~ source_code_hash               = "g72H21hzjs5j+x0s/n1xP8hBuwU3VQ/c+S8NacRWwRk=" -> "Fyfre+R49NXthHmeORvdo0adEyoq+FWXVblI/zB/qCM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-02-03T07:41:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "QUA1r8+lCwOGtqRRbBKW19SQa33cWhdDO3cW6PFXPbI=" -> "lY0JjuSJ5NrdoQtiB1ZxXCBYKG6xmysG8/t/4eJxPjE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-02-03T07:42:19.000+0000" -> (known after apply)
      ~ source_code_hash               = "Jt04wz7VQqw+29CemxqdsUdykAe06EojceTyr9p+lKY=" -> "CYzkKsDQytGG0lg3bu3LQmD5+7IU6f0PrL7/T44aYs0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-02-03T07:41:23Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "30bbte" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-02-03T07:41:21Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_api_gateway_method.quarters_report_method will be updated in-place
  ~ resource "aws_api_gateway_method" "quarters_report_method" {
        id                   = "agm-kb7gblbu69-gfvl0r-GET"
      ~ request_parameters   = {
          + "method.request.querystring.period"           = false
          ~ "method.request.querystring.years"            = true -> false
            # (7 unchanged elements hidden)
        }
        # (8 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-02-03T07:41:21Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 96 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dsgarcia8, Action: `pull_request`*